{
    "summary": "The code implements the CFBI Video Object Segmentation model proposed by Baidu in ECCV 2020, considering background and foreground for segmentation, predicting on current frames given reference frame and previous frame. It follows DAVIS guidelines, uses \"cfbip_davis.yaml\" configuration file, pretrained weights \"CFBIp_davis.pdparams\", saves predictions to \"result_root\", provides evaluation metrics including J&F-Mean, and references checkpoint file \"CFBIp_r101_davis.pdparams\".",
    "details": [
        {
            "comment": "This code describes the CFBI Video Object Segmentation model, proposed by Baidu in ECCV 2020. It considers background as important as foreground and uses collaborative integration for segmentation. The model predicts segmentation of current frames given reference frame and previous frame. Data preparation follows DAVIS guidelines.",
            "location": "\"/media/root/Prima/works/PaddleVideo/docs/src/english_documents/model_zoo/segmentation/cfbi.md\":0-28",
            "content": "[简体中文](../../../zh-CN/model_zoo/recognition/cfbi.md) | English\n# CFBI\n---\n## Contents\n- [Introduction](#Introduction)\n- [Data](#Data)\n- [Test](#Test)\n- [Reference](#Reference)\n## Introduction\nCFBI is a Video Object Segmentation model proposed by Baidu in ECCV 2020. This method consider background should be equally treated and thus propose Collaborative video object segmentation by Foreground-Background Integration (CFBI) approach. Our CFBI implicitly imposes the feature embedding from the target foreground object and its corresponding background to be contrastive, promoting the segmentation results accordingly.  Given the image and target segmentation of the reference frame (the first frame) and the previous frame, the model will predict the segmentation of the current frame.\n<div align=\"center\">\n<img src=\"../../../images/cfbi.png\" height=400 width=600 hspace='10'/> <br />\n</div>\n## Data\nPlease refer to DAVIS data download and preparation doc [DAVIS-data](../../dataset/davis.md)\n## Test\n- Test scripts:"
        },
        {
            "comment": "This code is running a segmentation model trained using the \"cfbip_davis.yaml\" configuration file, and testing it with pretrained weights stored in \"CFBIp_davis.pdparams\". The predicted results will be saved to the \"result_root\" directory. Evaluation metrics for this model on DAVIS dataset are provided, including J&F-Mean, J-Mean, J-Recall, J-Decay, F-Mean, F-Recall and F-Decay. The checkpoint file is referenced as \"CFBIp_r101_davis.pdparams\" which can be found at the provided URL.",
            "location": "\"/media/root/Prima/works/PaddleVideo/docs/src/english_documents/model_zoo/segmentation/cfbi.md\":30-45",
            "content": "```bash\npython3.7 main.py --test -c configs/segmentation/cfbip_davis.yaml -w CFBIp_davis.pdparams\n```\n- Predicted results will be saved in `result_root`. To get evaluation metrics, please use [davis2017-evaluation tools](https://github.com/davisvideochallenge/davis2017-evaluation).\nMetrics on DAVIS:\n| J&F-Mean | J-Mean | J-Recall | J-Decay | F-Mean | F-Recall | F-Decay | checkpoints |\n| :------: | :-----: | :----: | :----: | :----: | :----: | :----: | :----: |\n| 0.823 | 0.793 | 0.885 | 0.083 | 0.852 | 0.932 | 0.100 | [CFBIp_r101_davis.pdparams](https://videotag.bj.bcebos.com/PaddleVideo-release2.2/CFBIp_r101_davis.pdparams) |\n## Reference\n- [Collaborative Video Object Segmentation by Foreground-Background Integration](https://arxiv.org/abs/2003.08333), Zongxin Yang, Yunchao Wei, Yi Yang"
        }
    ]
}