{
    "summary": "This code allows users to download the Kinetics-400 dataset using two methods and provides a script for extracting frames. The training and validation sets require around 135GB and 2TB of storage space, respectively. Two data categories are included with list file links.",
    "details": [
        {
            "comment": "This code provides information on downloading the Kinetics-400 dataset, which is commonly used in video tasks. It offers two methods for download: Baidu network disk and script download. The code also directs to official resources like the Kinetics website and ActivityNet repository for further details.",
            "location": "\"/media/root/Prima/works/PaddleVideo/docs/src/english_documents/dataset/k400.md\":0-26",
            "content": "[简体中文](../../zh-CN/dataset/k400.md) | English\n# Kinetics-400 Preparation\n- [Introduction](#Introduction)\n- [Download](#Download)\n- [Frames](#Frames)\n---\n## Introduction\nKinetics-400 is a commonly used benchmark dataset in the video field. Please refer to its official website [Kinetics](https://deepmind.com/research/open-source/kinetics) for details. You can refer to the official address [ActivityNet](https://github.com/activitynet/ActivityNet/tree/master/Crawler/Kinetics), and use the download script provided to download the dataset.\n## Download\nConsidering the difficulty of downloading the K400 data set, we provide two download methods: (1) Baidu network disk download (2) Script download\n### Baidu SkyDrive Download\nNetdisk link: https://pan.baidu.com/s/1S_CGBjWOUAuxL_cCX5kMPg\nExtraction code: `ppvi`\n### Script download\n- Download the training set link list file [train_link.list](https://ai-rank.bj.bcebos.com/Kinetics400/train_link.list) and the validation set link list file [val_link.list](https://ai-rank.bj.bcebos.com/Kinetics400/val_link.list)."
        },
        {
            "comment": "This script downloads training and validation sets from provided links, unzips them, and adds the data paths to respective list files. Due to broken video links, approximately 135GB of storage space is required. The frames extracted from videos help in accelerating network training.",
            "location": "\"/media/root/Prima/works/PaddleVideo/docs/src/english_documents/dataset/k400.md\":28-64",
            "content": "Write the download script `download.sh` as follows:\n```bash\nfile=$1\nwhile read line \ndo\n  wget \"$line\"\ndone <$file\n```\nDownload training set command:\n```bash\nbash download.sh train_link.list\n```\nDownload verification set command:\n```bash\nbash download.sh val_link.list\n```\n---\n|category | Number of data  | list file |\n| :------: | :----------: | :----: |\n|Training set | 234619  |  [train.list](https://videotag.bj.bcebos.com/PaddleVideo/Data/Kinetic400/train.list)|\n|Validation set | 19761 |  [val.list](https://videotag.bj.bcebos.com/PaddleVideo/Data/Kinetic400/val.list)|\n- After downloading, unzip and add the data path to list file.\n- Due to the failure of some video link, part of original data is missing. This copies need about 135G of storage space.\n> This copies is only used for academic research. If it is helpful to you, welcome to star [our project](https://github.com/PaddlePaddle/PaddleVideo)\n## Frames\nIn order to speed up the training process of the network, we first extract frames from the video file (K4"
        },
        {
            "comment": "This code explains how to extract frames from the K400 video file in mp4 format using the \"extract_rawframes.py\" script, and provides the command to execute it with specified paths for videos and raw frames folders, along with level and ext parameters. The extracted frames will be stored in the ./rawframes path, occupying around 2TB of space. The code also mentions two data categories - training set (234619 files) and validation set (19761 files), along with their respective list file links for easy reference.",
            "location": "\"/media/root/Prima/works/PaddleVideo/docs/src/english_documents/dataset/k400.md\":64-77",
            "content": "00 video file is in mp4 format). Compared with the method of network training directly through video files, the method of frames can greatly accelerate the speed of network training。\nEnter the following command to extract the frames of the K400 video file\n```python\npython extract_rawframes.py ./videos/ ./rawframes/ --level 2 --ext mp4\n```\nAfter the video file frames are extracted, they will be stored in the specified `./rawframes` path, and the size is about 2T.\n|category | Number of data  | list file |\n| :------: | :----------: | :----: |\n|Training set | 234619  |  [train_frames.list](https://videotag.bj.bcebos.com/PaddleVideo/Data/Kinetic400/train_frames.list)|\n|Validation set | 19761 |  [val_frames.list](https://videotag.bj.bcebos.com/PaddleVideo/Data/Kinetic400/val_frames.list)|"
        }
    ]
}