{
    "summary": "The Figure Skating Dataset offers 30 fps competition videos with Open Pose key points, and includes train_data, train_label, test_A_data, and test_B_data, downloadable from the competition's homepage. RGB datasets unavailable due to copyright reasons.",
    "details": [
        {
            "comment": "Figure Skating Dataset provides video materials from Figure Skating Championships (2017-2018) standardized to 30 frames per second and 1080 * 720 image size. It uses Open Pose for key points extraction and saves data in .npy format. The dataset includes train_data, train_label, test_A_data, and test_B_data with respective counts. Train_label can be read using np.",
            "location": "\"/media/root/Prima/works/PaddleVideo/docs/src/english_documents/dataset/fsd.md\":0-25",
            "content": "[简体中文](../../zh-CN/dataset/fsd.md) | English\n# Figure Skating Dataset\n- [Introduction](#Introduction)\n- [Download](#Download)\n---\n## Introduction\nIn figure skating, compared with other sports, human posture and trajectory show the characteristics of strong complexity, which is helpful to the research of fine-grained action recognition tasks.\nFor FSD Dataset, all video materials are collected from the Figure Skating Championships from 2017 to 2018. The frame rate of the video is uniformly standardized to 30 frames per second, and the image size is 1080 * 720 to ensure the relative consistency of the dataset. After that, we use the 2D pose estimation algorithm Open Pose to extract frame by frame key points from the video, and finally save the data in `.npy` format.\nThe directory structure of training dataset and test dataset is as follows:\n```txt\ntrain_data.npy        # 2922\ntrain_label.npy       # 2922\ntest_A_data.npy       # 628\ntest_B_data.npy       # 634\n```\n`train_label.npy` can be read using `np."
        },
        {
            "comment": "This code describes the structure and meaning of a tensor in the dataset, with dimensions N (number of samples), C (coordinates and confidence of joint points), T (duration of action), V (number of joint points), and M (number of athletes). It also includes an example image of a skeleton to illustrate the joint points' positions. The data can be downloaded from the competition homepage after registration.",
            "location": "\"/media/root/Prima/works/PaddleVideo/docs/src/english_documents/dataset/fsd.md\":25-46",
            "content": "load()`, each element is an integer variable with a value between 0-29, representing the label of the action. `data.npy` can be read using `np.load()`, return a tensor with the shape of `N×C×T×V×M`, the specific meaning of each dimension is as follows:\n| Dimension | Size | Meaning\t| Notes |\n| :---- | :----: | :----: | :---- |\n| N\t| N\t| Number of samples | - |\n| C | 3\t| The coordinates and confidence of each joint point respectively |\trescale to -1~1 |\n| T\t| 1500 |\t The duration of the action\t| The actual length of some actions may be less than 1500, in such case we will pad 0 to ensure the unity of T dimension. |\n| V |\t25 | Number of joint points |\tSee the skeleton example below for the meaning of specific joint points. |\n| M |\t1\t|  Number of athletes\t| - |\nskeleton example：\n<div align=\"left\">\n  <img src=\"../../images/skeleton_example.png\" width=\"180px\"/><br>\n</div>\n## Download\nYou can get the download link after registering on the [competition homepage](https://www.datafountain.cn/competitions/519)."
        },
        {
            "comment": "This code provides dataset information for a PaddleVideo English document. It mentions the Train set with its data and label file URLs, while noting that RGB datasets are not available due to copyright reasons. TestA's data and labels will be provided soon.",
            "location": "\"/media/root/Prima/works/PaddleVideo/docs/src/english_documents/dataset/fsd.md\":48-54",
            "content": "| Set | Data | Label\t|\n| :---- | :----: | :----: |\n| Train\t| [train_data.npy](https://videotag.bj.bcebos.com/Data/FSD_train_data.npy)\t| [train_label.npy](https://videotag.bj.bcebos.com/Data/FSD_train_label.npy) |\n| TestA\t| comming soon\t| comming soon |\n> RGB datasets would not be provided for copyright reasons."
        }
    ]
}